[
  {
    "business_name": "Liquor Emporium",
    "summary": "Most customers praise the store for its wide variety of products, friendly staff, and convenient location, though a few complain about poor service from specific cashiers and sudden price increases under new ownership.",
    "risk_score": 4,
    "risk_reason": "While the majority of reviews are positive, there are concerns about inconsistent service and potential price gouging."
  },
  {
    "business_name": "La Hacienda Nightclub",
    "summary": "Customers have reported significant issues with pricing, feeling overcharged and harassed by staff. Many complain about being scammed and having to pay exorbitant prices for drinks. While some praise the atmosphere and service, the overall experience is largely negative, with several mentions of unethical practices and safety concerns.",
    "risk_score": 7,
    "risk_reason": "High volume of negative reviews, complaints about overcharging, and unethical practices suggest potential risks for customers."
  },
  {
    "business_name": "Mango Tango Nightclub | Club Nocturno | Las Vegas",
    "summary": "Customers generally praise Mango Tango for its lively atmosphere, excellent service, and great music, with many highlighting the attentiveness of their servers. However, a few reviews mention issues such as high prices, poor service, and concerns about security and cleanliness. Some also report feeling overcharged or misled about pricing.",
    "risk_score": 4,
    "risk_reason": "While the majority of reviews are positive, a few complaints about pricing, service, and cleanliness indicate potential issues."
  },
  {
    "business_name": "Zuna Nightclub",
    "summary": "Zuna Nightclub is highly praised for its excellent service, great music, and lively atmosphere. Customers consistently highlight the friendliness of the staff and the enjoyable experience, with many recommending it as a top spot for dancing and socializing. However, a few negative reviews mention issues with bathroom cleanliness and high drink prices.",
    "risk_score": 2,
    "risk_reason": "The majority of reviews are positive, with no significant mentions of illegal activities or safety concerns."
  },
  {
    "business_name": "Peppermint Hippo",
    "summary": "Customers overwhelmingly praise Peppermint Hippo for its excellent service, friendly staff, and lively atmosphere. Servers like Azeneth, Kassandra, and Val are highlighted for their attentiveness and positive energy, making the experience enjoyable for patrons.",
    "risk_score": 1,
    "risk_reason": "No negative reviews mention illegal activities or safety concerns, and the vast majority of reviews are highly positive."
  },
  {
    "business_name": "Club EGO Afterhours",
    "summary": "Club EGO Afterhours is highly praised for its vibrant atmosphere, excellent music, and outstanding service, particularly from its bartenders like London and Alex. However, a few negative reviews mention issues such as excessive smoke, aggressive security, and even physical altercations, which are concerning.",
    "risk_score": 3,
    "risk_reason": "While the majority of reviews are overwhelmingly positive, a few negative experiences involving security and smoke could pose risks for visitors."
  },
  {
    "business_name": "ZAI Nightclub Las Vegas",
    "summary": "The single review left for ZAI Nightclub Las Vegas is completely empty, suggesting no feedback on the quality or experience. However, given the 0.0/5 rating, it's clear that the business has received no positive reviews and likely faces significant issues.",
    "risk_score": 10,
    "risk_reason": "The absence of any reviews combined with the lowest possible rating indicates extreme dissatisfaction and potential serious problems."
  },
  {
    "business_name": "Oddfellows",
    "summary": "Oddfellows receives mixed reviews, with many praising the venue's atmosphere, music, and staff, while others complain about rude bartenders, aggressive security, and incidents of harassment and theft. The venue offers a unique, themed experience, but some customers feel unsafe or uncomfortable, particularly regarding gender-based pricing and alleged drug incidents.",
    "risk_score": 6,
    "risk_reason": "There are several negative reviews mentioning harassment, theft, and drug incidents, which pose safety concerns and indicate potential shady practices."
  },
  {
    "business_name": "Raised By Wolves",
    "summary": "Customers overwhelmingly praise Raised By Wolves for its exceptional bartenders, particularly Nicky, who receives numerous compliments for her friendly, attentive, and skilled service. The atmosphere, music, and overall experience are highly rated, with many returning customers. However, a few negative reviews mention issues with the all-you-can-drink package and perceived lack of quality in drinks.",
    "risk_score": 2,
    "risk_reason": "While the majority of reviews are positive, a couple of negative reviews suggest potential issues with the all-you-can-drink package and drink quality, which could indicate inconsistent service."
  },
  {
    "business_name": "Bar latino El Rincón Nayarita",
    "summary": "Customers generally enjoy the lively atmosphere, music, and friendly staff, with many praising the live band and DJs. However, there are significant complaints about high prices, aggressive behavior from staff, and incidents of theft and harassment. Some also mention concerns about drug use and illegal activities.",
    "risk_score": 7,
    "risk_reason": "While the business has a mix of positive and negative reviews, the frequent mentions of aggressive staff, theft, and potential illegal activities indicate a moderate risk."
  },
  {
    "business_name": "El Firme Night Club",
    "summary": "El Firme Night Club has received mixed reviews, with some praising the live music and overall atmosphere while others complain about rude staff, loud music, and issues with management. There are also reports of aggressive behavior and fraudulent practices that have led to negative experiences for some customers.",
    "risk_score": 7,
    "risk_reason": "The presence of aggressive behavior, complaints about staff behavior, and reports of fraudulent practices contribute to a moderate risk level."
  },
  {
    "business_name": "Las Adelitas",
    "summary": "Customers overwhelmingly praise Las Adelitas for its excellent atmosphere, friendly staff, and enjoyable experience, with no negative feedback mentioned.",
    "risk_score": 1,
    "risk_reason": "All reviews are highly positive with no mentions of any issues."
  },
  {
    "business_name": "Strip Club Concierge Las Vegas Downtown",
    "summary": "The business receives mixed reviews, with some customers enjoying the strip club and related services while others found it confusing or uncomfortable. One review mentions potential issues with buying marijuana without a medical card, which could indicate illegal activities.",
    "risk_score": 6,
    "risk_reason": "Mixed reviews include confusion about the service and a mention of potential illegal drug sales."
  },
  {
    "business_name": "Legacy Club",
    "summary": "No customer reviews are available for Legacy Club, making it difficult to gauge public opinion.",
    "risk_score": 5,
    "risk_reason": "In the absence of reviews, there is moderate risk due to lack of information."
  },
  {
    "business_name": "The Parlour at El Cortez",
    "summary": "Customers generally praise The Parlour at El Cortez for its cozy atmosphere, good drinks, and friendly service, though one review mentions an unsatisfactory experience due to a rude manager during happy hour.",
    "risk_score": 2,
    "risk_reason": "The majority of reviews are positive, with only one negative review regarding rude management."
  },
  {
    "business_name": "Las Vegas Boulevard at Fremont Street",
    "summary": "As there are no reviews available, it is currently impossible to gauge customer sentiment towards Las Vegas Boulevard at Fremont Street.",
    "risk_score": 1,
    "risk_reason": "In the absence of reviews, the business appears safe, but this is speculative."
  },
  {
    "business_name": "Discopussy",
    "summary": "Discopussy receives mixed reviews, with some praising the music, atmosphere, and staff while others criticize the high prices, aggressive security, and poor customer service. Many complain about being overcharged, having drinks tampered with, and feeling unsafe due to inappropriate behavior from security guards.",
    "risk_score": 7,
    "risk_reason": "There are significant complaints about aggressive security, overcharging, and unsafe conditions, which pose a risk to customers."
  },
  {
    "business_name": "Gold Spike",
    "summary": "There are currently no customer reviews available for Gold Spike.",
    "risk_score": 1,
    "risk_reason": "In the absence of any reviews, there is no information indicating risk or safety concerns."
  },
  {
    "business_name": "Dino's Lounge",
    "summary": "No customer reviews are available for Dino's Lounge, which may indicate a lack of recent activity or that it is a new establishment.",
    "risk_score": 5,
    "risk_reason": "The absence of reviews suggests limited data on the business's reliability and customer satisfaction."
  },
  {
    "business_name": "Patio Nightclub",
    "summary": "No customer reviews are available for Patio Nightclub, indicating either a new establishment or that it has not yet received feedback.",
    "risk_score": 2,
    "risk_reason": "In the absence of reviews, there is limited information to assess potential risks."
  },
  {
    "business_name": "Badlands Las Vegas",
    "summary": "No customer reviews are available for Badlands Las Vegas.",
    "risk_score": 5,
    "risk_reason": "In the absence of reviews, there is no immediate indication of issues, but lack of feedback can also mean the business is new or not well-known."
  },
  {
    "business_name": "Speakeasy Liquor",
    "summary": "Customers generally praise Speakeasy Liquor for its friendly staff, wide selection, and competitive prices. However, some complain about inconsistent pricing, long wait times due to staff bathroom breaks, and occasionally encounter issues with prices and service. Negative reviews mention a marijuana smell inside and security concerns.",
    "risk_score": 4,
    "risk_reason": "While the majority of reviews are positive, there are a few complaints about inconsistent pricing and service, which could indicate potential issues with management and operations."
  },
  {
    "business_name": "Ken's SOS Liquors",
    "summary": "Customers generally praise Ken's SOS Liquors for its wide selection, friendly staff, and 24-hour availability, though some complain about inconsistent pricing, rude service, and long wait times. Negative reviews often mention issues with the store's 24-hour policy and unhelpful employees.",
    "risk_score": 4,
    "risk_reason": "There are some complaints about rude service and long wait times, but overall, the majority of reviews are positive."
  },
  {
    "business_name": "Liquor Stop",
    "summary": "Most customers praise the store for its wide selection, helpful staff, and competitive prices. However, a few reviews mention safety concerns, such as homeless people loitering and aggressive behavior, as well as issues with pricing discrepancies and customer service.",
    "risk_score": 4,
    "risk_reason": "While the majority of reviews are positive, a few negative reviews highlight safety concerns and pricing issues."
  },
  {
    "business_name": "Value Market & Liquor",
    "summary": "No customer reviews are available for Value Market & Liquor, indicating either a new business or that it has not yet received significant feedback.",
    "risk_score": 1,
    "risk_reason": "In the absence of reviews, there is no information to suggest any issues, making it appear safe."
  },
  {
    "business_name": "XO Liquor",
    "summary": "XO Liquor is highly regarded for its excellent customer service, wide selection, and friendly staff. However, some customers have complained about high prices and the presence of unsavory individuals in the area, particularly at night. The majority of reviews are positive, but a few mention concerns about value and safety.",
    "risk_score": 4,
    "risk_reason": "While the business generally receives positive feedback, a few negative reviews highlight high prices and safety concerns, warranting moderate risk."
  },
  {
    "business_name": "Los Primos Liquor",
    "summary": "No customer reviews are available for Los Primos Liquor.",
    "risk_score": 5,
    "risk_reason": "In the absence of reviews, there is no immediate indication of risk, but lack of feedback can also mean the business is new or not well-known."
  },
  {
    "business_name": "Las Palmas Liquors",
    "summary": "Customers generally praise Las Palmas Liquors for its wide variety of spirits, friendly staff, and good prices, though some complain about issues such as selling to minors and poor customer service during late-night visits.",
    "risk_score": 4,
    "risk_reason": "There are a couple of negative reviews mentioning illegal activities (selling to minors) and subpar customer service, but these are outweighed by the majority of positive feedback."
  },
  {
    "business_name": "Diamond Liquor",
    "summary": "Customers generally praise Diamond Liquor for its extensive selection, friendly staff, and excellent customer service. However, a few negative reviews mention issues such as selling expired products and feeling unsafe, which detract from the overall positive experience.",
    "risk_score": 3,
    "risk_reason": "While the majority of reviews are positive, a couple of negative reviews highlight potential issues with product quality and safety concerns."
  },
  {
    "business_name": "Maxi Mart Liquor",
    "summary": "There are currently no customer reviews available for Maxi Mart Liquor.",
    "risk_score": 1,
    "risk_reason": "In the absence of any reviews, there is no information indicating potential risks."
  },
  {
    "business_name": "Discount Liquor",
    "summary": "Customers generally praise Discount Liquor for its friendly staff, great selection, and competitive prices, though a few negative reviews mention issues such as rude service, security concerns, and fraudulent activities. The majority of reviews are positive, indicating a reliable and reputable store.",
    "risk_score": 2,
    "risk_reason": "The business has a predominantly positive review base with only a few negative comments regarding rudeness and security concerns."
  },
  {
    "business_name": "Vegas Market & Liquor",
    "summary": "Customers generally praise the store for its friendly staff, good prices, and variety of items, though some complain about slow service, inconsistent pricing, and issues with 24-hour availability. Negative reviews often mention long wait times and a few unhelpful employees.",
    "risk_score": 4,
    "risk_reason": "There are some complaints about service and pricing discrepancies, but the majority of reviews are positive."
  },
  {
    "business_name": "Mom and Pop's Liquor Store",
    "summary": "Without any reviews, it's difficult to gauge customer sentiment towards Mom and Pop's Liquor Store.",
    "risk_score": 1,
    "risk_reason": "In the absence of reviews, there is no information indicating any issues."
  },
  {
    "business_name": "Lakeview Liquor",
    "summary": "Customers generally praise Lakeview Liquor for its excellent prices, friendly staff, and overall quality service, though there are a few complaints about double charging and low star ratings.",
    "risk_score": 2,
    "risk_reason": "The majority of reviews are positive, with only a couple of negative experiences reported."
  },
  {
    "business_name": "5 Star Market & Liquor",
    "summary": "Without any reviews, it's currently impossible to gauge customer sentiment towards 5 Star Market & Liquor.",
    "risk_score": 1,
    "risk_reason": "No reviews available, indicating either a new business or lack of customer feedback."
  },
  {
    "business_name": "Bonanza Liquor Store",
    "summary": "Customers generally complain about overpriced items and poor service, with several reviewers mentioning issues related to price gouging and unsatisfactory transactions. Despite some positive comments about the variety of products and friendly staff, the overall sentiment is negative.",
    "risk_score": 7,
    "risk_reason": "The business faces significant risk due to numerous negative reviews and complaints about overpricing and poor service."
  },
  {
    "business_name": "Sahara Liquor",
    "summary": "Customers overwhelmingly praise Sahara Liquor for its excellent customer service, friendly staff, and wide variety of products. However, a few negative reviews mention issues such as rudeness, price gouging, and a small selection of certain items.",
    "risk_score": 2,
    "risk_reason": "The business has a predominantly positive review base, with only a few negative experiences reported."
  },
  {
    "business_name": "Crown Liquor 2",
    "summary": "There are currently no customer reviews available for Crown Liquor 2.",
    "risk_score": 1,
    "risk_reason": "In the absence of any reviews, there is no information indicating risk."
  },
  {
    "business_name": "City Market & Liquor",
    "summary": "Customers highly praise the store for its great selection, friendly service, and fair deals. The store is noted for providing essential items and being non-judgmental towards homeless individuals.",
    "risk_score": 1,
    "risk_reason": "All reviews are positive with no mentions of illegal activities or safety concerns."
  },
  {
    "business_name": "Amigo Liquor Store",
    "summary": "Customers generally praise the store for its wide selection, cleanliness, and friendly staff, though a few complain about high prices, limited variety, and poor service. One review mentions racial discrimination, while another reports theft and suspicion of surveillance.",
    "risk_score": 4,
    "risk_reason": "While the majority of reviews are positive, there are a few complaints about pricing, variety, and a concerning incident of potential racial discrimination."
  },
  {
    "business_name": "Strip Smoke Shop",
    "summary": "Customers overwhelmingly praise Strip Smoke Shop for its excellent customer service, friendly staff, and wide variety of products. The majority of reviews are highly positive, with a few complaints about poor customer service and inconsistent inventory.",
    "risk_score": 1,
    "risk_reason": "The business receives mostly positive reviews with no mentions of illegal activities or safety concerns."
  },
  {
    "business_name": "Las Vegas Paiute Tribal Smoke Shop",
    "summary": "Customers generally praise the store for its friendly staff, great prices, and wide selection of tobacco products, with many noting the lack of taxes as a significant advantage. However, a few reviews mention issues with customer service, particularly with newer employees and security measures, and some complain about rising prices. Negative reviews are relatively few compared to positive ones.",
    "risk_score": 2,
    "risk_reason": "The business has a predominantly positive review base with only minor complaints, indicating a generally reputable operation."
  },
  {
    "business_name": "Biggie 24HR Smoke Shop & Delivery",
    "summary": "Customers overwhelmingly praise Biggie 24HR Smoke Shop & Delivery for its 24/7 availability, excellent customer service, and wide selection of smoking supplies. The shop is known for its friendly staff, particularly Daisy, and offers competitive prices. However, one negative review mentions inconsistent pricing, which stands out among the predominantly positive feedback.",
    "risk_score": 2,
    "risk_reason": "The business has a nearly perfect rating with only one negative review mentioning inconsistent pricing, indicating a very low risk."
  },
  {
    "business_name": "Gold Rush Smoke Shop",
    "summary": "Gold Rush Smoke Shop is highly regarded by its customers, with nearly all reviews praising the staff's friendliness, excellent customer service, and wide selection of products. However, a few negative reviews mention issues with pricing and one incident of potential fraud where the customer was double-charged.",
    "risk_score": 3,
    "risk_reason": "While the majority of reviews are positive, a couple of negative reviews suggest potential issues with pricing and a single instance of possible fraud."
  },
  {
    "business_name": "Wisemen Smoke Shop & Vape",
    "summary": "Wisemen Smoke Shop & Vape receives overwhelmingly positive reviews with customers praising the friendly staff, great customer service, and competitive prices. However, one review mentions that the store facilitates credit/debit card theft without verifying IDs, raising concerns about safety and responsible business practices.",
    "risk_score": 3,
    "risk_reason": "While the majority of reviews are positive, one review highlights a significant issue with potential fraud, which warrants some concern."
  },
  {
    "business_name": "Gold Rush 24HR Smoke Shop",
    "summary": "Gold Rush 24HR Smoke Shop generally receives positive reviews for its 24-hour availability, knowledgeable staff, and wide selection of products. However, a few customers report issues with pricing, customer service, and receiving defective products, particularly during late-night shifts.",
    "risk_score": 4,
    "risk_reason": "While the majority of reviews are positive, there are a few complaints about pricing discrepancies, rude staff, and receiving faulty products, indicating potential issues with customer satisfaction."
  },
  {
    "business_name": "SMOKE LAND",
    "summary": "Customers overwhelmingly praise Smoke Land for excellent customer service, knowledgeable staff, and a wide variety of products. However, a few negative reviews mention issues with customer service and opening hours.",
    "risk_score": 1,
    "risk_reason": "The business has a predominantly positive review set with only minor complaints."
  },
  {
    "business_name": "24hr Smoke King Vape Kratom Smokes Glass",
    "summary": "No customer reviews are available for this business.",
    "risk_score": 7,
    "risk_reason": "Lack of reviews makes it difficult to assess the business's reliability and customer satisfaction."
  },
  {
    "business_name": "THREE KINGS SMOKE SHOP, VAPE AND CIGAR STORE LAS VEGAS",
    "summary": "Customers overwhelmingly praise the store for its excellent service, wide variety of products, and friendly staff. However, a few negative reviews mention issues with product quality, long wait times, and poor customer service during exchanges. Overall, the store appears reputable, but there are minor concerns.",
    "risk_score": 2,
    "risk_reason": "While the majority of reviews are positive, a few negative reviews indicate potential issues with product quality and customer service during exchanges."
  },
  {
    "business_name": "Carlito's Way Smoke Shop",
    "summary": "Customers generally praise Carlito's Way Smoke Shop for its wide selection, friendly staff, and excellent customer service, though some have complained about inconsistent pricing, rude employees, and issues with product quality. The overall sentiment is mixed but leans positive.",
    "risk_score": 3,
    "risk_reason": "While the majority of reviews are positive, there are significant complaints about pricing inconsistencies and rude staff, indicating potential reliability issues."
  },
  {
    "business_name": "Fuzzy's Smoke Shop",
    "summary": "Fuzzy's Smoke Shop generally receives positive reviews for its extensive product selection, knowledgeable and friendly staff, and overall positive shopping experience. However, there are a few negative reviews regarding political discussions during interactions and one instance of perceived price gouging. The majority of reviews are highly positive, indicating a mostly reputable business.",
    "risk_score": 2,
    "risk_reason": "The business has a high number of positive reviews and only minor complaints, suggesting a generally safe and reputable operation."
  },
  {
    "business_name": "LUAM Smoke Vape OHMS",
    "summary": "Customers generally have positive experiences with knowledgeable and helpful staff, but there are several complaints about rude and unprofessional behavior, particularly from female employees. Some also mention issues with business hours and pricing, which are higher than competitors.",
    "risk_score": 4,
    "risk_reason": "While the business has a majority of positive reviews, there are significant complaints about rude staff and inconsistent business hours, which could indicate potential issues with management and customer service."
  },
  {
    "business_name": "SMOKE & VAPOR-KRATOM",
    "summary": "Customers overwhelmingly praise the business for its friendly staff, wide selection, and excellent customer service, with many giving it 5-star ratings. However, a few negative reviews mention issues such as poor customer treatment, false advertising, and product problems, indicating some inconsistency.",
    "risk_score": 2,
    "risk_reason": "While the majority of reviews are positive, a couple of negative reviews highlight potential issues with customer service and product accuracy."
  },
  {
    "business_name": "D Smoke Shop",
    "summary": "D Smoke Shop generally receives positive reviews for its friendly staff, good prices, and wide selection of products. However, some customers have complained about inconsistent service, price hikes, and issues with product freshness. Negative reviews often mention long wait times and outdated stock.",
    "risk_score": 3,
    "risk_reason": "While the majority of reviews are positive, there are occasional complaints about service inconsistencies and product quality, which could indicate potential issues."
  },
  {
    "business_name": "Insane Vape & Smoke Shop",
    "summary": "Customers overwhelmingly praise Insane Vape & Smoke Shop for its excellent customer service, knowledgeable staff, and wide variety of products. The shop is described as clean, friendly, and offering great deals.",
    "risk_score": 1,
    "risk_reason": "The business has no negative reviews and only positive feedback regarding customer service, product selection, and pricing."
  },
  {
    "business_name": "Smoke & Vape Shop 4420",
    "summary": "No customer reviews are available for Smoke & Vape Shop 4420.",
    "risk_score": 2,
    "risk_reason": "In the absence of reviews, there is no information indicating any issues."
  },
  {
    "business_name": "SNS Smoke shop",
    "summary": "Customers generally have mixed feelings about SNS Smoke shop, praising its variety and friendly staff while also complaining about inconsistent inventory, poor customer service, and product defects. Some customers report receiving defective products and experiencing rude behavior from employees, particularly from a specific worker named Alexia.",
    "risk_score": 7,
    "risk_reason": "The business faces significant customer dissatisfaction due to product issues and employee behavior, which could lead to reputational damage and loss of customers."
  },
  {
    "business_name": "Happy Daze Smoke & Vape",
    "summary": "Customers overwhelmingly praise Happy Daze Smoke & Vape for its excellent customer service, knowledgeable staff, and wide variety of products. The majority of reviews are 5-star, highlighting the friendliness and helpfulness of the employees, especially Singh.",
    "risk_score": 1,
    "risk_reason": "The business has a high volume of positive reviews and no mentions of illegal activities or negative issues."
  },
  {
    "business_name": "Smokers (Smoke Shop)",
    "summary": "The majority of customers praise the smoke shop for its excellent customer service, knowledgeable staff, and wide range of products. However, a few negative reviews mention unprofessionalism, broken products, and issues with customer service.",
    "risk_score": 2,
    "risk_reason": "Despite a few negative reviews, the overall sentiment is overwhelmingly positive, and there are no mentions of illegal activities or serious issues."
  },
  {
    "business_name": "VapOrSmoke",
    "summary": "Customers overwhelmingly praise VapOrSmoke for its excellent customer service, friendly staff, and competitive prices. The store is described as having a great selection and a welcoming atmosphere.",
    "risk_score": 1,
    "risk_reason": "No negative reviews or mentions of illegal activities or safety concerns."
  }
]